app/views/confirmation_mailer/confirmation_email.html.erb

SELECT  "employees".* FROM "employees"   ORDER BY "employees"."id" DESC LIMIT 1
---
  <tbody>
    <% Employee.all.each do |employee| %>