app/controllers/employees_controller.rb

  def email
    # @employee = Employee.find(params[:id])
    Employee.first.destroy
---
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 1]]
SELECT  "employees".* FROM "employees"   ORDER BY "employees"."id" DESC LIMIT 1

  def create

    @employee = Employee.new(employee_params)
    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("created_at", "email", "first_name", "last_name", "shift_start_time", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", "2014-08-06 23:16:01.422662"], ["email", ""], ["first_name", ""], ["last_name", ""], ["shift_start_time", ""], ["title", ""], ["updated_at", "2014-08-06 23:16:01.422662"]]

  def update
    @employee = Employee.find(params[:id])
    respond_to do |format|
      if @employee.update(employee_params)
---
SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "employees" SET "hours_worked" = ?, "updated_at" = ? WHERE "employees"."id" = 3  [["hours_worked", 2225454], ["updated_at", "2014-08-06 20:57:06.848151"]]